# Data Visualisation Project

In this project for CA682, We will be looking at interesting facts that we find from the data set that is provided by Imdb website. This data set consists of movies and tv series, actors, ratings, genres, etc. It would be interesting to see the trend of genres through the years, and which genre was most enjoyed in which decade. 

First let is import the necessary libraries and data set.

In [1]:
import pandas as pd

In [2]:
dataset_names = pd.read_csv('I:/DCU/SEM1/Lectures/Data Management & Visualisation - CA682 Suzanne Little/project/imdb_project/data/names.tsv', delimiter='\t')
dataset_titles_basic = pd.read_csv('I:/DCU/SEM1/Lectures/Data Management & Visualisation - CA682 Suzanne Little/project/imdb_project/data/title_basic.tsv', delimiter='\t')
dataset_ratings = pd.read_csv('I:/DCU/SEM1/Lectures/Data Management & Visualisation - CA682 Suzanne Little/project/imdb_project/data/ratings.tsv', delimiter='\t')
dataset_title_prin = pd.read_csv('I:/DCU/SEM1/Lectures/Data Management & Visualisation - CA682 Suzanne Little/project/imdb_project/data/title_principals.tsv', delimiter='\t')

I:\Softwares\anaconda\lib\site-packages\IPython\core\interactiveshell.py:2785: DtypeWarning: Columns (5) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

Lets explore the data sets to understand it.

In [ ]:
dataset_titles_basic.head()

In [5]:
dataset_title_prin.shape

(31153380, 6)

In [ ]:
dataset_names.head()

In [ ]:
dataset_ratings.head()

In [ ]:
dataset_title_prin.head()

From the data sets we can see that some of the values have been added with commas, lets separate these values into different columns for easy analysis

In [4]:
new = dataset_titles_basic['genres'].str.split(",",n=2,expand = True)

In [5]:
dataset_titles_basic['genre1'] = new[0]
dataset_titles_basic['genre2'] = new[1]
dataset_titles_basic.drop(columns =["genres"], inplace = True)

In [6]:
dataset_titles_basic.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genre1,genre2
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,Documentary,Short
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,Animation,Short
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,Animation,Comedy
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,\N,Animation,Short
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,Comedy,Short

In [7]:
new = dataset_names['knownForTitles'].str.split(",",n=4,expand = True)

In [8]:
dataset_names['knownForTitles1'] = new[0]
dataset_names['knownForTitles2'] = new[1]
dataset_names['knownForTitles3'] = new[2]
dataset_names['knownForTitles4'] = new[3]
dataset_names.drop(columns =["knownForTitles"], inplace = True)

In [10]:
dataset_names.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles1,knownForTitles2,knownForTitles3,knownForTitles4
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous",tt0053137,tt0050419,tt0043044,tt0072308
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack",tt0037382,tt0071877,tt0117057,tt0038355
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,producer",tt0049189,tt0054452,tt0057345,tt0059956
3,nm0000004,John Belushi,1949,1982,"actor,writer,soundtrack",tt0072562,tt0077975,tt0080455,tt0078723
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor",tt0060827,tt0050986,tt0050976,tt0083922

Let's filter out only actor and actresses data for our analysis

In [11]:
new = dataset_names['primaryProfession'].str.split(",",n=1,expand = True)

In [12]:
dataset_names['primaryProfession1'] = new[0]
dataset_names.drop(columns =["primaryProfession"], inplace = True)

In [13]:
dataset_names = dataset_names.drop(dataset_names[(dataset_names.primaryProfession1!='actor') & (dataset_names.primaryProfession1!='actress')].index)

In [14]:
dataset_names.head()

,nconst,primaryName,birthYear,deathYear,knownForTitles1,knownForTitles2,knownForTitles3,knownForTitles4,primaryProfession1
1,nm0000002,Lauren Bacall,1924,2014,tt0037382,tt0071877,tt0117057,tt0038355,actress
2,nm0000003,Brigitte Bardot,1934,\N,tt0049189,tt0054452,tt0057345,tt0059956,actress
3,nm0000004,John Belushi,1949,1982,tt0072562,tt0077975,tt0080455,tt0078723,actor
5,nm0000006,Ingrid Bergman,1915,1982,tt0071877,tt0038787,tt0034583,tt0038109,actress
6,nm0000007,Humphrey Bogart,1899,1957,tt0043265,tt0037382,tt0034583,tt0033870,actor

Dropping unnecessary columns

In [15]:
dataset_names.drop(columns =["birthYear"], inplace = True) 
dataset_names.drop(columns =["deathYear"], inplace = True)

In [16]:
dataset_names.head()

,nconst,primaryName,knownForTitles1,knownForTitles2,knownForTitles3,knownForTitles4,primaryProfession1
1,nm0000002,Lauren Bacall,tt0037382,tt0071877,tt0117057,tt0038355,actress
2,nm0000003,Brigitte Bardot,tt0049189,tt0054452,tt0057345,tt0059956,actress
3,nm0000004,John Belushi,tt0072562,tt0077975,tt0080455,tt0078723,actor
5,nm0000006,Ingrid Bergman,tt0071877,tt0038787,tt0034583,tt0038109,actress
6,nm0000007,Humphrey Bogart,tt0043265,tt0037382,tt0034583,tt0033870,actor

Removing unnecessary columns from  dataset_titles_basic data set

In [17]:
dataset_titles_basic.drop(columns =["endYear"], inplace = True)

In [ ]:
dataset_titles_basic.head()

In [ ]:
dataset_title_prin.head()

Removing data for other than actors and actresses in dataset_title_prin

In [18]:
dataset_title_prin = dataset_title_prin.drop(dataset_title_prin[(dataset_title_prin.category!='actor')&(dataset_title_prin.category != 'actress')].index)

In [ ]:
dataset_title_prin.head()

In [ ]:
dataset_ratings.head()

In [ ]:
dataset_titles_basic.head()

Merging rating tables with titles basic table

In [19]:
dataset_titles_basic_rating = dataset_titles_basic.merge(dataset_ratings,left_on='tconst',right_on='tconst')

In [ ]:
dataset_titles_basic_rating.head()

We can see that start year contains some blank values marked by \N. lets remove those values and convert the data type of startYear to numeric.

In [20]:
dataset_titles_basic_rating = dataset_titles_basic_rating.drop(dataset_titles_basic_rating[(dataset_titles_basic_rating['startYear'] == "\\N")].index)
dataset_titles_basic_rating['startYear'] = pd.to_numeric(dataset_titles_basic_rating['startYear'])

Lets export the cleaned data to csv files.

In [21]:
export_csv = dataset_titles_basic_rating.to_csv(r'I:\DCU\SEM1\Lectures\Data Management & Visualisation - CA682 Suzanne Little\project\imdb_project\cleaned data\titles_basic_rating.csv', index = None, header=True)
export_csv = dataset_title_prin.to_csv(r'I:\DCU\SEM1\Lectures\Data Management & Visualisation - CA682 Suzanne Little\project\imdb_project\cleaned data\titles_principle.csv', index = None, header=True)
export_csv = dataset_names.to_csv(r'I:\DCU\SEM1\Lectures\Data Management & Visualisation - CA682 Suzanne Little\project\imdb_project\cleaned data\names.csv', index = None, header=True)